#### Terragrunt Format and Style 🖌`success`
#### Terragrunt Initialization ⚙️`success`
#### Terragrunt Plan 📖`success`
#### Terragrunt Validation 🤖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.this["thesamcro.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Purchased from GoDaddy. Expires on 21/04/2023."
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "thesamcro.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "thesamcro.com"
        }
      + tags_all            = {
          + "Environment" = "dev"
          + "Name"        = "thesamcro.com"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + route53_zone_name         = {
      + "thesamcro.com" = "thesamcro.com"
    }
  + route53_zone_name_servers = {
      + "thesamcro.com" = (known after apply)
    }
  + route53_zone_zone_arn     = {
      + "thesamcro.com" = (known after apply)
    }
  + route53_zone_zone_id      = {
      + "thesamcro.com" = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
aws_vpc.this[0]: Refreshing state... [id=vpc-0d94ad3dc3cf9d85c]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-09f7900d0480aed0a]
aws_route_table.private[0]: Refreshing state... [id=rtb-0073747fb42ccdab4]
aws_default_security_group.this[0]: Refreshing state... [id=sg-07db7ad127aca9b9c]
aws_route_table.public[0]: Refreshing state... [id=rtb-005957174f54f5c6d]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-014282ca4ee0f3cc9]
aws_subnet.public[1]: Refreshing state... [id=subnet-06bd693a610ba1902]
aws_subnet.private[0]: Refreshing state... [id=subnet-0968647d51820050b]
aws_subnet.private[1]: Refreshing state... [id=subnet-0c922c6a98dcf1e3b]
aws_subnet.public[0]: Refreshing state... [id=subnet-07cc71c8ccae57316]
aws_subnet.public[2]: Refreshing state... [id=subnet-0818b77399efcd5c4]
aws_subnet.private[2]: Refreshing state... [id=subnet-08c7c8dc742580a6e]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-036440546d8eb0c76]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-005957174f54f5c6d1080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01739f9831d365050]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b588fcc72e3cd5f3]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-064aae29ec5049a56]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0787749d2487d9d0a]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0790709fe9bd34646]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f4adf4b730a8d5ea]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>

*Pushed by: @obstaclex, Action: `pull_request`, Working Directory: `workload`, Workflow: `Terragrunt CI/CD pipeline`*